title QR-code
color 3
@echo off
chcp 65001
cls
echo.
echo.
echo.
echo.
echo.
echo.
echo.
echo.
echo.
echo.                                                                                               
echo                                                                                                ░██████╗░██████╗░░░░░░░░█████╗░░█████╗░██████╗░███████╗
echo                                                                                                ██╔═══██╗██╔══██╗░░░░░░██╔══██╗██╔══██╗██╔══██╗██╔════╝
echo                                                                                                ██║██╗██║██████╔╝█████╗██║░░╚═╝██║░░██║██║░░██║█████╗░░
echo                                                                                                ╚██████╔╝██╔══██╗╚════╝██║░░██╗██║░░██║██║░░██║██╔══╝░░
echo                                                                                                ░╚═██╔═╝░██║░░██║░░░░░░╚█████╔╝╚█████╔╝██████╔╝███████╗
echo                                                                                                ░░░╚═╝░░░╚═╝░░╚═╝░░░░░░░╚════╝░░╚════╝░╚═════╝░╚══════╝
echo.
echo                                                                        -------------------------------------------------------------------------------------------------
echo.
echo                                                                         1. Включите интернет
echo                                                                         2. Скачайте Python, по ссылке: https://www.python.org/ftp/python/3.12.0/python-3.12.0-amd64.exe
echo                                                                         3. Запустите файл: python-3.12.0-amd64.exe
echo                                                                         4. Когда вылезло окно установки - нажмите на кнопку || Add python.exe to path.
echo                                                                         5. Нажмите на кнопку Install Now
echo                                                                         6. После установки Python - запустите файл start.bat в папке QR-code
echo                                                                         7. Введите текст который будет указан на QR-коде (Пример: Математика)
echo                                                                         8. Введите название файла, в который будет сохранен ваш QR-Code (Пример: qrcode)
echo                                                                         9. Просканируйте получившийся QR-код
echo.
echo                                                                        -------------------------------------------------------------------------------------------------
echo.
echo.
echo.
echo.
echo.
pause
python code.py